In [2]:
# 导入基本库
import numpy as np
import pandas as pd

In [3]:
# 载入上一个任务人保存的文件中:result.csv，并查看这个文件
result = pd.read_csv('../titanic/result.csv')
result

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,447,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,448,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,449,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,450,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,451,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
#计算泰坦尼克号男性与女性的平均票价
means = (result['Fare'].groupby(result['Sex'])).mean()

In [18]:
#统计泰坦尼克号中男女的存活人数
survived_sex = result['Survived'].groupby(result['Sex']).sum() #describe()

In [6]:
#计算客舱不同等级的存活人数
result['Survived'].groupby(result['Pclass']).sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [7]:
#这些运算可以通过agg()函数来同时计算
result.groupby('Sex').agg({'Fare': 'mean', 'Pclass': 'count'}).rename(columns=
                            {'Fare': 'mean_fare', 'Pclass': 'count_pclass'})

        mean_fare  count_pclass
Sex
female  44.479818           314
male    25.523893           577

In [15]:
#任务五：统计在不同等级的票中的不同年龄的船票花费的平均值
result['Fare'].groupby([result['Sex'],result['Pclass']]).mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [22]:
#任务六：将任务二和任务三的数据合并，并保存到sex_fare_survived.csv
result1 = pd.merge(means,survived_sex,on='Sex')
result1

             Fare  Survived
Sex
female  44.479818       233
male    25.523893       109

In [23]:
result1.to_csv('../titanic/sex_fare_survived.csv')

In [26]:
#任务七：得出不同年龄的总的存活人数，然后找出存活人数最多的年龄段，最后计算存活人数最高的存活率（存活人数/总人数）
survived_age = result['Survived'].groupby(result['Age']).sum()
survived_age

Age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    0
70.50    0
71.00    0
74.00    0
80.00    1
Name: Survived, Length: 88, dtype: int64

In [29]:
survived_age[survived_age.values == survived_age.max()]

Age
24.0    15
Name: Survived, dtype: int64

In [30]:
#首先计算总人数
_sum = result['Survived'].sum()

print("sum of person:"+str(_sum))

precetn =survived_age.max()/_sum

print("最大存活率："+str(precetn))

sum of person:342
最大存活率：0.043859649122807015